backend/app/controllers/users_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at") VALUES ('obakeng@me.org', '$2a$12$eeQ/kZkESMGU9EKotXbJIuOU7M1KFniYTYR9o6mqjzQ6tZmripOae', '2025-06-19 11:14:36.979065', '2025-06-19 11:14:36.979065') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save